Revit 2026 API

# BuiltInFailuresRenderFailures Class

---

Failures related to rendering.

SystemObject Autodesk.Revit.DBBuiltInFailuresRenderFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RenderFailures
```
```vb
Public NotInheritable Class RenderFailures
```
```cpp
public ref class RenderFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RenderFailures = class end
```

The BuiltInFailuresRenderFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LightParametersNotInRange | The value should be in range of [Value] and [Value]. |
|  | LightSourceInsideGeometry | Light source is inside solid geometry. No light will be emitted during rendering. |
|  | ProhibitDeletionLightSource | The light source cannot be deleted with UI. |
|  | RenderLibNotInstalledWarn | Rendering library has not been installed, so the third party geometry cannot be created. |

#### Reference

Autodesk.Revit.DB Namespace